data_generation/simulation_results/of/case_42/constant/simParams
nIter 2000;
hComponent0 1081.4244662450828;
hComponent1 1200.4129878052195;
hComponent2 548.0921490097388;
hComponent3 1153.5002086736204;
hComponent4 1301.0486977407522;kComponent0 53.42332020468345;
kComponent1 17.22082186048469;
kComponent2 89.6984740744715;
kComponent3 83.74535554774114;
kComponent4 14.001056168800332;
tAmbient 300;
Ux 0.7380744663240424;
kPCB 0.4508480979659578;